app/controllers/blogs_controller.rb

  def create
    Blog.create(text: blog_params[:text], user_id: current_user.id)
---
INSERT INTO `blogs` (`text`, `user_id`, `created_at`, `updated_at`) VALUES ('qqqqqqqqqq', '1', '2018-08-31 04:37:53', '2018-08-31 04:37:53')

  def destroy
    blog = Blog.find(params[:id])
    if blog.user_id == current_user.id
       blog.destroy
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 3 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 3

  def edit
    @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 4 LIMIT 1

  def show
    @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 5 LIMIT 1

  def update
    blog = Blog.find(params[:id])
    if blog.user_id == current_user.id
      blog.update(blog_params)
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 4 LIMIT 1
UPDATE `blogs` SET `text` = 'ffafafafassssssssssss', `updated_at` = '2018-08-31 05:15:50' WHERE `blogs`.`id` = 4