app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`user_id` = '1'  ORDER BY created_at DESC
---
  def show
    user = User.find(params[:id])
    @blogs = user.blogs.order("created_at DESC")